"use strict"

//З клавіатури вводиться ціна товару і кількість грошей. Якщо грошей не вистачає то відмовляємо у покупці, інакше, якщо ще залишаються гроші, то пропонуємо купити лотерею за 4 грн.

//Крок 0. Позначення величин
// ціна товару - priceProduct
// кількість грошей - numberMoney

//Крок 1. Введення необхідних даних

let priceProduct = parseFloat(prompt('Введіть ціну товару', ''))
let numberMoney = parseInt(prompt('Введіть кількість грошей', ''))

//Крок 2. Обчислення
if (numberMoney < priceProduct)
	alert('У вас недостатньо коштів')
else 
	alert('Купити лотерею за 4 грн')
