"use strict"

/*
	Виводити на екран скільки хвилин користувач вже на сайті
*/

//=============== Не мій варіант1 ===============

//=============== Не мій варіант2 ===============

//=============== Не мій варіант3 ===============

//=============== Не мій варіант4 ===============

//=============== Мій варіант1 ==================
window.onload = function () {
	let minutesSpent = 0;
	
	// Функція оновлення таймера
	function updateTimeSpent() {
		minutesSpent++;
		document.getElementById("timeSpent").textContent = minutesSpent;
	}

	// Викликати функцію кожну хвилину (60000 мілісекунд)
	setInterval(updateTimeSpent, 60000);
}
//=============== Мій варіант2 ==================