"use strict"

/*
	На формі вводять 7 числових значень (вік, зріст, вага, заробітна плата, стаж, номер відділу, порядковий номер). Додати подію обробки події click на форму і якщо клік на внутрішньому input, то автоматично замінювати значення його на 0. Використати делегування
*/

//=============== Не мій варіант1 ===============

//=============== Не мій варіант2 ===============

//=============== Не мій варіант3 ===============

//=============== Не мій варіант4 ===============

//=============== Мій варіант1 ==================
// Додаємо слухач подій до форми, використовуючи делегування
document.getElementById('dataForm').addEventListener('click', function(event) {
	// Перевіряємо, чи елемент, на якому був клік, є input
	if (event.target.tagName === 'INPUT') {
		// Заміна значення input на 0
		event.target.value = 0;
	}
});

//=============== Мій варіант2 ==================